In [1]:
import pandas as pd

In [24]:
transaction = pd.read_csv('transaction.csv')
transaction.head()

  transaction_id   price         payment_date customer_id
0    T0000000113  210000  2019-02-01 01:36:57    PL563502
1    T0000000114   50000  2019-02-01 01:37:23    HD678019
2    T0000000115  120000  2019-02-01 02:34:19    HD298120
3    T0000000116  210000  2019-02-01 02:47:23    IK452215
4    T0000000117  170000  2019-02-01 04:33:46    PL542865

In [14]:
# メンバ（変数）の例
transaction.shape

(6786, 4)

In [15]:
# メソッド（関数）の例
transaction.describe()

               price
count    6786.000000
mean   143108.605953
std     77597.965237
min     50000.000000
25%     85000.000000
50%    120000.000000
75%    210000.000000
max    750000.000000

In [10]:
df = pd.read_csv('transaction.csv')
df.head()

  transaction_id   price         payment_date customer_id
0    T0000000113  210000  2019-02-01 01:36:57    PL563502
1    T0000000114   50000  2019-02-01 01:37:23    HD678019
2    T0000000115  120000  2019-02-01 02:34:19    HD298120
3    T0000000116  210000  2019-02-01 02:47:23    IK452215
4    T0000000117  170000  2019-02-01 04:33:46    PL542865

In [11]:
df_price = pd.DataFrame(df["price"])
df_price.head()

    price
0  210000
1   50000
2  120000
3  210000
4  170000

In [3]:
price = transaction["price"]
price

0       210000
1        50000
2       120000
3       210000
4       170000
         ...
6781    180000
6782     85000
6783    100000
6784     85000
6785     85000
Name: price, Length: 6786, dtype: int64

In [7]:
price2 = pd.DataFrame(transaction["price"])
price2.head()

    price
0  210000
1   50000
2  120000
3  210000
4  170000

In [8]:
customer_price = transaction[["customer_id", "price"]] # ["customer_id", "price"] はリスト
customer_price.head()

  customer_id   price
0    PL563502  210000
1    HD678019   50000
2    HD298120  120000
3    IK452215  210000
4    PL542865  170000

In [9]:
lst = ["price", "customer_id"]
price_customer = transaction[lst]
price_customer.head()

    price customer_id
0  210000    PL563502
1   50000    HD678019
2  120000    HD298120
3  210000    IK452215
4  170000    PL542865

In [26]:
transaction["d_price"] = transaction["price"] * 2
transaction.head()

  transaction_id   price         payment_date customer_id  d_price
0    T0000000113  210000  2019-02-01 01:36:57    PL563502   420000
1    T0000000114   50000  2019-02-01 01:37:23    HD678019   100000
2    T0000000115  120000  2019-02-01 02:34:19    HD298120   240000
3    T0000000116  210000  2019-02-01 02:47:23    IK452215   420000
4    T0000000117  170000  2019-02-01 04:33:46    PL542865   340000

In [27]:
transaction["d_price"] = transaction["d_price"] * 2
transaction.head()

  transaction_id   price         payment_date customer_id  d_price
0    T0000000113  210000  2019-02-01 01:36:57    PL563502   840000
1    T0000000114   50000  2019-02-01 01:37:23    HD678019   200000
2    T0000000115  120000  2019-02-01 02:34:19    HD298120   480000
3    T0000000116  210000  2019-02-01 02:47:23    IK452215   840000
4    T0000000117  170000  2019-02-01 04:33:46    PL542865   680000